turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/Atmel.SAM4C_DFP.pdsc
         <device Dname="ATSAM4CP16C">
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="NO_FPU"
                       Pname="0"/>
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="SP_FPU"
                       Pname="1"/>
            <compile header="sam4cp/include/sam.h" Pname="0" define="__SAM4CP16C_0__"/>
            <debug svd="sam4cp/svd/ATSAM4CP16C_0.svd" Pname="0"/>
            <memory id="IROM1"
                    start="0x01000000"
                    size="0x00100000"
                    Pname="0"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x02000000" size="0x01000000" Pname="0"/>
            <memory id="IRAM1"
                    start="0x20000000"
                    size="0x00020000"
                    Pname="0"
                    default="1"/>
            <memory id="IRAM2" start="0x20080000" size="0x00004000" Pname="0"/>
            <memory id="IRAM3" start="0x20100000" size="0x00002000" Pname="0"/>
            <algorithm name="sam4cp/keil/Flash/ATSAM4C_1024.FLM"
                       start="0x01000000"
                       size="0x100000"
                       default="1"/>
            <compile header="sam4cp/include/sam.h" Pname="1" define="__SAM4CP16C_1__"/>
            <debug svd="sam4cp/svd/ATSAM4CP16C_1.svd" Pname="1"/>
            <memory id="IROM1"
                    start="0x01000000"
                    size="0x00100000"
                    Pname="1"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x02000000" size="0x01000000" Pname="1"/>
            <memory id="IRAM1"
                    start="0x20080000"
                    size="0x00004000"
                    Pname="1"
                    default="1"/>
            <memory id="IRAM2" start="0x20100000" size="0x00002000" Pname="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="sam4cp/atdf/ATSAM4CP16C_0.atdf" Pname="0"/>
                  <at:variant ordercode="ATSAM4CP16C-AU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"
                              Pname="0"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="IFLASH"
                             start="0x01000000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="IROM"
                             start="0x02000000"
                             size="0x01000000"
                             type="rom"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="IRAM0"
                             start="0x20000000"
                             size="0x00020000"
                             type="ram"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00004000"
                             type="ram"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="IRAM2"
                             start="0x20100000"
                             size="0x00002000"
                             type="ram"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="EBI_CS0"
                             start="0x60000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="EBI_CS1"
                             start="0x61000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="EBI_CS2"
                             start="0x62000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="0"/>
                  <at:memory name="EBI_CS3"
                             start="0x63000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="0"/>
                  <at:interface type="samjtag" name="JTAG" Pname="0"/>
                  <at:interface type="swd" name="SWD" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger" Pname="0"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice" Pname="0"/>
                  <at:project name="Barebone C Project" Pname="0">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project" Pname="0">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling"
                                   Tcompiler="GCC"
                                   component="ARM-GCC"
                                   Pname="0"/>
                  <at:prerequisite context="compiling"
                                   Tcompiler="IAR"
                                   component="ARM-IAR"
                                   Pname="0"/>
                  <at:prerequisite context="compiling"
                                   Tcompiler="ARMCC"
                                   component="ARMCC"
                                   Pname="0"/>
                  <at:atdf name="sam4cp/atdf/ATSAM4CP16C_1.atdf" Pname="1"/>
                  <at:variant ordercode="ATSAM4CP16C-AU"
                              vccmin="1.62"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"
                              Pname="1"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="IFLASH"
                             start="0x01000000"
                             size="0x00100000"
                             type="flash"
                             pagesize="512"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="IROM"
                             start="0x02000000"
                             size="0x01000000"
                             type="rom"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00004000"
                             type="ram"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="IRAM2"
                             start="0x20100000"
                             size="0x00002000"
                             type="ram"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="EBI_CS0"
                             start="0x60000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="EBI_CS1"
                             start="0x61000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="EBI_CS2"
                             start="0x62000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="1"/>
                  <at:memory name="EBI_CS3"
                             start="0x63000000"
                             size="0x01000000"
                             type="other"
                             mirror-mask="0x10000000"
                             address-space="base"
                             Pname="1"/>
                  <at:interface type="samjtag" name="JTAG" Pname="1"/>
                  <at:interface type="swd" name="SWD" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger" Pname="1"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice" Pname="1"/>
                  <at:project name="Barebone C Project" Pname="1">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project" Pname="1">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling"
                                   Tcompiler="GCC"
                                   component="ARM-GCC"
                                   Pname="1"/>
                  <at:prerequisite context="compiling"
                                   Tcompiler="IAR"
                                   component="ARM-IAR"
                                   Pname="1"/>
                  <at:prerequisite context="compiling"
                                   Tcompiler="ARMCC"
                                   component="ARMCC"
                                   Pname="1"/>
               </at:extension>
            </environment>
         </device>
      </family>
   </devices>
   <conditions>
      <condition id="ARMCC">
         <accept Tcompiler="ARMCC"/>
      </condition>
      <condition id="ARMCC Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
      </condition>
      <condition id="GCC">
         <accept Tcompiler="GCC"/>
      </condition>
      <condition id="GCC Exe">
         <accept Tcompiler="GCC" Toutput="exe"/>
      </condition>
      <condition id="IAR">
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="IAR Exe">
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C">
         <accept Tcompiler="ARMCC"/>
         <accept Tcompiler="GCC"/>
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="C Exe">
         <accept Tcompiler="ARMCC" Toutput="exe"/>
         <accept Tcompiler="GCC" Toutput="exe"/>
         <accept Tcompiler="IAR" Toutput="exe"/>
      </condition>
      <condition id="C Lib">
         <accept Tcompiler="ARMCC" Toutput="lib"/>
         <accept Tcompiler="GCC" Toutput="lib"/>
         <accept Tcompiler="IAR" Toutput="lib"/>
      </condition>
      <condition id="ATSAM4C4C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4C4C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
