turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/Atmel.SAM4C_DFP.pdsc
      <condition id="ATSAM4C4C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4C4C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C8C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4C8C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C8C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4C8C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C16C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4C16C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C16C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4C16C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C32C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4C32C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C32C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4C32C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C32E:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4C32E" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4C32E:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4C32E" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMP8C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMP8C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMP8C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMP8C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMP16C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMP16C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMP16C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMP16C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS4C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS4C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS4C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS4C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS8C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS8C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS8C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS8C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS16C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS16C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS16C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS16C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMP32C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMP32C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMP32C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMP32C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS32C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS32C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CMS32C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CMS32C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CP16B:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CP16B" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CP16B:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CP16B" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CP16C:0">
         <require Dvendor="Atmel:3" Dname="ATSAM4CP16C" Pname="0"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4CP16C:1">
         <require Dvendor="Atmel:3" Dname="ATSAM4CP16C" Pname="1"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C4C:0">
         <description>Headers and startup code for Atmel ATSAM4C4C:0</description>
         <files>
            <file condition="C" category="include" name="sam4c/include"/>
            <file condition="C" category="header" name="sam4c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/system_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/gcc/startup_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c/gcc/gcc/sam4c4c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c4c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/ARM/startup_SAM4C.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/system_SAM4C.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/system_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/iar/startup_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c/iar/iar/sam4c4c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c/iar/iar/sam4c4c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C4C:1">
         <description>Headers and startup code for Atmel ATSAM4C4C:1</description>
         <files>
            <file condition="C" category="include" name="sam4c/include"/>
            <file condition="C" category="header" name="sam4c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/system_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/gcc/startup_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c/gcc/gcc/sam4c4c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c4c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/ARM/startup_SAM4C.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/system_SAM4C.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/system_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/iar/startup_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c/iar/iar/sam4c4c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c/iar/iar/sam4c4c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C8C:0">
         <description>Headers and startup code for Atmel ATSAM4C8C:0</description>
         <files>
            <file condition="C" category="include" name="sam4c/include"/>
            <file condition="C" category="header" name="sam4c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/system_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/gcc/startup_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c/gcc/gcc/sam4c8c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c8c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/ARM/startup_SAM4C.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/system_SAM4C.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/system_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/iar/startup_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c/iar/iar/sam4c8c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c/iar/iar/sam4c8c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C8C:1">
         <description>Headers and startup code for Atmel ATSAM4C8C:1</description>
         <files>
            <file condition="C" category="include" name="sam4c/include"/>
            <file condition="C" category="header" name="sam4c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/system_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/gcc/startup_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c/gcc/gcc/sam4c8c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c8c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/ARM/startup_SAM4C.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/system_SAM4C.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/system_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/iar/startup_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c/iar/iar/sam4c8c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c/iar/iar/sam4c8c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C16C:0">
         <description>Headers and startup code for Atmel ATSAM4C16C:0</description>
         <files>
            <file condition="C" category="include" name="sam4c/include"/>
            <file condition="C" category="header" name="sam4c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/system_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/gcc/startup_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c/gcc/gcc/sam4c16c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c16c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/ARM/startup_SAM4C.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/system_SAM4C.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/system_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/iar/startup_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c/iar/iar/sam4c16c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c/iar/iar/sam4c16c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
