turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/Atmel.SAM4C_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C16C:1">
         <description>Headers and startup code for Atmel ATSAM4C16C:1</description>
         <files>
            <file condition="C" category="include" name="sam4c/include"/>
            <file condition="C" category="header" name="sam4c/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/system_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c/gcc/gcc/startup_sam4c.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c/gcc/gcc/sam4c16c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c16c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c/gcc/gcc/sam4c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/ARM/startup_SAM4C.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c/armcc/Device/Source/system_SAM4C.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/system_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c/iar/iar/startup_sam4c.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c/iar/iar/sam4c16c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c/iar/iar/sam4c16c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C32C:0">
         <description>Headers and startup code for Atmel ATSAM4C32C:0</description>
         <files>
            <file condition="C" category="include" name="sam4c32/include"/>
            <file condition="C" category="header" name="sam4c32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/system_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/gcc/startup_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c32/gcc/gcc/sam4c32c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/ARM/startup_SAM4C32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/iar/startup_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c32/iar/iar/sam4c32c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c32/iar/iar/sam4c32c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C32C:1">
         <description>Headers and startup code for Atmel ATSAM4C32C:1</description>
         <files>
            <file condition="C" category="include" name="sam4c32/include"/>
            <file condition="C" category="header" name="sam4c32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/system_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/gcc/startup_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c32/gcc/gcc/sam4c32c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/ARM/startup_SAM4C32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/iar/startup_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c32/iar/iar/sam4c32c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c32/iar/iar/sam4c32c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C32E:0">
         <description>Headers and startup code for Atmel ATSAM4C32E:0</description>
         <files>
            <file condition="C" category="include" name="sam4c32/include"/>
            <file condition="C" category="header" name="sam4c32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/system_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/gcc/startup_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c32/gcc/gcc/sam4c32e_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32e_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/ARM/startup_SAM4C32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/iar/startup_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c32/iar/iar/sam4c32e_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c32/iar/iar/sam4c32e_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4C32E:1">
         <description>Headers and startup code for Atmel ATSAM4C32E:1</description>
         <files>
            <file condition="C" category="include" name="sam4c32/include"/>
            <file condition="C" category="header" name="sam4c32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4c32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4c32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/system_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4c32/gcc/gcc/startup_sam4c32.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4c32/gcc/gcc/sam4c32e_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32e_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4c32/gcc/gcc/sam4c32_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/ARM/startup_SAM4C32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4c32/armcc/Device/Source/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/system_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4c32/iar/iar/startup_sam4c32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4c32/iar/iar/sam4c32e_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4c32/iar/iar/sam4c32e_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMP8C:0">
         <description>Headers and startup code for Atmel ATSAM4CMP8C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cmp8c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cmp8c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cmp8c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cmp8c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMP8C:1">
         <description>Headers and startup code for Atmel ATSAM4CMP8C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cmp8c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cmp8c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cmp8c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cmp8c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
