turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/Atmel.SAM4C_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMP16C:0">
         <description>Headers and startup code for Atmel ATSAM4CMP16C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cmp16c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cmp16c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cmp16c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cmp16c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMP16C:1">
         <description>Headers and startup code for Atmel ATSAM4CMP16C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cmp16c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cmp16c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cmp16c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cmp16c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS4C:0">
         <description>Headers and startup code for Atmel ATSAM4CMS4C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cms4c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cms4c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cms4c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cms4c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS4C:1">
         <description>Headers and startup code for Atmel ATSAM4CMS4C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cms4c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cms4c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cms4c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cms4c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS8C:0">
         <description>Headers and startup code for Atmel ATSAM4CMS8C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cms8c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cms8c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cms8c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cms8c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS8C:1">
         <description>Headers and startup code for Atmel ATSAM4CMS8C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cms8c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cms8c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cms8c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cms8c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS16C:0">
         <description>Headers and startup code for Atmel ATSAM4CMS16C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cms16c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cms16c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cms16c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cms16c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
