turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/Atmel.SAM4C_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS16C:1">
         <description>Headers and startup code for Atmel ATSAM4CMS16C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cm/include"/>
            <file condition="C" category="header" name="sam4cm/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm/gcc/gcc/sam4cms16c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cms16c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/ARM/startup_SAM4CM.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm/armcc/Device/SAM4CM/Source/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm/iar/iar/sam4cms16c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm/iar/iar/sam4cms16c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMP32C:0">
         <description>Headers and startup code for Atmel ATSAM4CMP32C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cm32/include"/>
            <file condition="C" category="header" name="sam4cm32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm32/gcc/gcc/sam4cmp32c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cmp32c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/ARM/startup_SAM4CM32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/system_sam4cm32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm32/iar/iar/sam4cmp32c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm32/iar/iar/sam4cmp32c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMP32C:1">
         <description>Headers and startup code for Atmel ATSAM4CMP32C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cm32/include"/>
            <file condition="C" category="header" name="sam4cm32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm32/gcc/gcc/sam4cmp32c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cmp32c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/ARM/startup_SAM4CM32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/system_sam4cm32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm32/iar/iar/sam4cmp32c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm32/iar/iar/sam4cmp32c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS32C:0">
         <description>Headers and startup code for Atmel ATSAM4CMS32C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cm32/include"/>
            <file condition="C" category="header" name="sam4cm32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm32/gcc/gcc/sam4cms32c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cms32c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/ARM/startup_SAM4CM32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/system_sam4cm32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm32/iar/iar/sam4cms32c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm32/iar/iar/sam4cms32c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CMS32C:1">
         <description>Headers and startup code for Atmel ATSAM4CMS32C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cm32/include"/>
            <file condition="C" category="header" name="sam4cm32/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cm32/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cm32/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/system_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cm32/gcc/gcc/startup_sam4cm.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cm32/gcc/gcc/sam4cms32c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cms32c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cm32/gcc/gcc/sam4cm_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/ARM/startup_SAM4CM32.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cm32/armcc/Device/SAM4CM32/Source/system_sam4cm32.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/system_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cm32/iar/iar/startup_sam4cm.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cm32/iar/iar/sam4cms32c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cm32/iar/iar/sam4cms32c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CP16B:0">
         <description>Headers and startup code for Atmel ATSAM4CP16B:0</description>
         <files>
            <file condition="C" category="include" name="sam4cp/include"/>
            <file condition="C" category="header" name="sam4cp/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/system_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/gcc/startup_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cp/gcc/gcc/sam4cp16b_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp16b_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/ARM/startup_SAM4CP.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/iar/startup_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cp/iar/iar/sam4cp16b_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cp/iar/iar/sam4cp16b_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CP16B:1">
         <description>Headers and startup code for Atmel ATSAM4CP16B:1</description>
         <files>
            <file condition="C" category="include" name="sam4cp/include"/>
            <file condition="C" category="header" name="sam4cp/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/system_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/gcc/startup_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cp/gcc/gcc/sam4cp16b_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp16b_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/ARM/startup_SAM4CP.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/iar/startup_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cp/iar/iar/sam4cp16b_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cp/iar/iar/sam4cp16b_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
