turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/Atmel.SAM4C_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CP16C:0">
         <description>Headers and startup code for Atmel ATSAM4CP16C:0</description>
         <files>
            <file condition="C" category="include" name="sam4cp/include"/>
            <file condition="C" category="header" name="sam4cp/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/system_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/gcc/startup_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cp/gcc/gcc/sam4cp16c_0_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp16c_0_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/ARM/startup_SAM4CP.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/iar/startup_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cp/iar/iar/sam4cp16c_0_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cp/iar/iar/sam4cp16c_0_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="ATSAM4CP16C:1">
         <description>Headers and startup code for Atmel ATSAM4CP16C:1</description>
         <files>
            <file condition="C" category="include" name="sam4cp/include"/>
            <file condition="C" category="header" name="sam4cp/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4cp/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4cp/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/system_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4cp/gcc/gcc/startup_sam4cp.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4cp/gcc/gcc/sam4cp16c_1_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp16c_1_sram.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4cp/gcc/gcc/sam4cp_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/ARM/startup_SAM4CP.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4cp/armcc/Device/Source/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/system_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4cp/iar/iar/startup_sam4cp.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4cp/iar/iar/sam4cp16c_1_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4cp/iar/iar/sam4cp16c_1_sram.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
